tap "jstkdng/programs"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# Claude Code usage and cost tracker
brew "ccusage"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Friendlier find
brew "ffind"
# Indent and beautify Fortran sources and generate dependency information
brew "findent"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast, Dynamic Programming Language
brew "julia"
# Simple terminal UI for git commands
brew "lazygit"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# Modern replacement for ps written in Rust
brew "procs"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to find ROP sequences in PE/Elf/Mach-O x86/x64 binaries
brew "rp"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Static analysis and linting for Bash/Shell scripts
brew "shellcheck"
# Cross-platform prompt for any shell
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Smart session manager for tmux
brew "sesh"
# Universal command argument completion
brew "carapace"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# An extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Yet Another Dotfiles Manager
brew "yadm"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# GitHub command-line tool
brew "gh"
# Neovim version manager
brew "bob"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Chromium based browser
cask "arc"
# Display management tool
cask "betterdisplay"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Free and open-source media player
cask "iina"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Collection of apps available by subscription
cask "setapp"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# Open-source code editor
cask "visual-studio-code"
